import openpyxl

wb = openpyxl.Workbook()
ws = wb.active

headers = [
    "Таб. номер",
    "Фамилия",
    "Отдел",
    "Сумма по окладу, руб.",
    "Сумма по надбавкам, руб.",
    "Сумма зарплаты, руб.",
    "НДФЛ, %",
    "Сумма НДФЛ, %",
    "Сумма к выдаче, руб.",
]
ws.append(headers)

data = [
    [
        {
            "Таб. номер": "0002",
            "Фамилия": "Петров П.П",
            "Отдел": "Бухгалтерия",
            "Сумма по окладу": 3913.04,
            "Сумма по надбавкам": 2608.70,
            "Сумма зарплаты": None,
            "НДФЛ": 13,
            "Сумма НДФЛ": None,
            "Сумма к выдаче": None,
        },
        {
            "Таб. номер": "0005",
            "Фамилия": "Васин В.В",
            "Отдел": "Бухгалтерия",
            "Сумма по окладу": 5934.78,
            "Сумма по надбавкам": 913.04,
            "Сумма зарплаты": None,
            "НДФЛ": 13,
            "Сумма НДФЛ": None,
            "Сумма к выдаче": None,
        },
    ],
    [
        {
            "Таб. номер": "0001",
            "Фамилия": "Иванов И.И",
            "Отдел": "Отдел кадров",
            "Сумма по окладу": 6000.00,
            "Сумма по надбавкам": 4000.00,
            "Сумма зарплаты": None,
            "НДФЛ": 13,
            "Сумма НДФЛ": None,
            "Сумма к выдаче": None,
        },
        {
            "Таб. номер": "0003",
            "Фамилия": "Сидоров С.С",
            "Отдел": "Отдел кадров",
            "Сумма по окладу": 5000.00,
            "Сумма по надбавкам": 4500.00,
            "Сумма зарплаты": None,
            "НДФЛ": 13,
            "Сумма НДФЛ": None,
            "Сумма к выдаче": None,
        },
        {
            "Таб. номер": "0006",
            "Фамилия": "Львов Л.Л",
            "Отдел": "Отдел кадров",
            "Сумма по окладу": 4074.07,
            "Сумма по надбавкам": 2444.44,
            "Сумма зарплаты": None,
            "НДФЛ": 13,
            "Сумма НДФЛ": None,
            "Сумма к выдаче": None,
        },
        {
            "Таб. номер": "0007",
            "Фамилия": "Волков В.В",
            "Отдел": "Отдел кадров",
            "Сумма по окладу": 1434.78,
            "Сумма по надбавкам": 1434.78,
            "Сумма зарплаты": None,
            "НДФЛ": 13,
            "Сумма НДФЛ": None,
            "Сумма к выдаче": None,
        },
    ],
    [
        {
            "Таб. номер": "0004",
            "Фамилия": "Мишин М.М",
            "Отдел": "Столовая",
            "Сумма по окладу": 5500.00,
            "Сумма по надбавкам": 3500.00,
            "Сумма зарплаты": None,
            "НДФЛ": 13,
            "Сумма НДФЛ": None,
            "Сумма к выдаче": None,
        },
    ],
]

total = {
    "Сумма по окладу": 0,
    "Сумма по надбавкам": 0,
    "Сумма зарплаты": 0,
    "Сумма НДФЛ": 0,
    "Сумма к выдаче": 0,
}
total_summ = {
    "Сумма по окладу": 0,
    "Сумма по надбавкам": 0,
    "Сумма зарплаты": 0,
    "Сумма НДФЛ": 0,
    "Сумма к выдаче": 0,
}

for i in data:
    total["Сумма по окладу"] = total["Сумма по надбавкам"] = total["Сумма зарплаты"] = (total["Сумма НДФЛ"]) = total["Сумма к выдаче"] = 0
    for j in i:
        otdel = j["Отдел"]
        j["Сумма зарплаты"] = round(j["Сумма по окладу"] + j["Сумма по надбавкам"], 2)
        j["Сумма НДФЛ"] = round(j["НДФЛ"]/100 * j["Сумма зарплаты"], 2)
        j["Сумма к выдаче"] = round(j["Сумма зарплаты"] - j["Сумма НДФЛ"], 2)

        total["Сумма по окладу"] += j["Сумма по окладу"]
        total["Сумма по надбавкам"] += j["Сумма по надбавкам"]
        total["Сумма зарплаты"] += j["Сумма зарплаты"]
        total["Сумма НДФЛ"] += j["Сумма НДФЛ"]
        total["Сумма к выдаче"] += j["Сумма к выдаче"]

        people = list(j.values())
        ws.append(people)
    info_1 = [
        "",
        "",
        otdel + " Итог",
        round(total["Сумма по окладу"], 2),
        round(total["Сумма по надбавкам"], 2),
        round(total["Сумма зарплаты"], 2),
        "",
        round(total["Сумма НДФЛ"], 2),
        round(total["Сумма к выдаче"], 2),
    ]
    ws.append(info_1)

    total_summ["Сумма по окладу"] += total["Сумма по окладу"]
    total_summ["Сумма по надбавкам"] += total["Сумма по надбавкам"]
    total_summ["Сумма зарплаты"] += total["Сумма зарплаты"]
    total_summ["Сумма НДФЛ"] += total["Сумма НДФЛ"]
    total_summ["Сумма к выдаче"] += total["Сумма к выдаче"]
info_2 = [
    "",
    "",
    "Общий итог",
    round(total_summ["Сумма по окладу"], 2),
    round(total_summ["Сумма по надбавкам"], 2),
    round(total_summ["Сумма зарплаты"], 2),
    "",
    round(total_summ["Сумма НДФЛ"], 2),
    round(total_summ["Сумма к выдаче"], 2),
]
ws.append(info_2)

output_file = "C:\\Users\\Бобр Даша\\Desktop\\university\\3 КУРС\\5 сем\\Язык Python для работы с данными\\lab_9\\salary.xlsx"
wb.save(output_file)
